GIT - распределённая система контроля версии
 Это система для отслеживания и ведение истории изменение ваших файлов и проектов
 
 Репозитории - хранилища ваших файлов которое вы отслеживаете при помощи гита, и их изменений.
 
 
 КОМАНДА GIT:
 
 1. git init - она создает новый гит репозитории локально на вашем пк, создаст она в той дтроектории где вы запускаете эту команду.
 
 2. Git add - когда мы изменяем  и создаём файлы, то при помощи этой команды мы загружаем  все изменеия и промежуточная место хранение 
    git add <file_name>
    git add . ->  все в текущей директории
 
 3. git commit - как только мы достигаем определённого момента в разработке, то мы сохраняем и комментируем все изменения в репезитории .(фиксация изменение в репо)
 
    git commit -m '<comment>'
    .


